app/controllers/original_data_file_controller.rb

  def show
    @all_odfs = OriginalDataFile.all
---
SELECT "original_data_files".* FROM "original_data_files"

  def show_file
  	@odf = OriginalDataFile.find(params[:id])
---
SELECT  "original_data_files".* FROM "original_data_files" WHERE "original_data_files"."odf_id" = ? LIMIT 1  [["odf_id", 1]]

  def upload
	  uploaded_io = params[:original_data_file][:data]
	  csv_file = File.open(uploaded_io.tempfile, 'rb') { |file| file.read }
	  csv_file.unpack('b*') # to binary file
	  @odf = OriginalDataFile.create(file: csv_file)
---
INSERT INTO "original_data_files" ("file", "created_at", "updated_at") VALUES (?, ?, ?)  [["file", "<14 bytes of binary data>"], ["created_at", "2015-12-01 10:58:15.027987"], ["updated_at", "2015-12-01 10:58:15.027987"]]