app/controllers/original_data_type_controller.rb

  def index
    @task = Task.find_by(:task_id => params[:task_id])
    @odts = OriginalDataType.get_task_odts(params[:task_id])
    @my_pdsf_num = 0
    @tuple_num = 0
    submit = Submit.where(:submit_user_id => current_user.user_id)
    implement_task = ImplementTask.where(:task_id => params[:task_id])
    if submit != nil
      @my_pdsf_num = submit.size
    end
    if implement_task != nil
      @tuple_num = implement_task.size
---
SELECT  "tasks".* FROM "tasks" WHERE "tasks"."task_id" = ? LIMIT 1  [["task_id", 1]]
SELECT  "submits".* FROM "submits" WHERE "submits"."submit_user_id" IS NULL LIMIT 1
SELECT  "implement_tasks".* FROM "implement_tasks" WHERE "implement_tasks"."task_id" = ? LIMIT 1  [["task_id", 1]]
SELECT COUNT(count_column) FROM (SELECT 1 AS count_column FROM "submits" WHERE "submits"."submit_user_id" = ?) subquery_for_count  [["submit_user_id", 3]]
SELECT  "tasks".* FROM "tasks" WHERE (1) LIMIT 1
SELECT COUNT(*) FROM "implement_tasks" WHERE "implement_tasks"."task_id" = ?  [["task_id", 1]]

  def show
    return if not admin_check
    @task = Task.find_by(task_id: params[:task_id])
    @odts = OriginalDataType.get_task_odts(params[:task_id])
    @pdsf_num = 0
    @tuple_num = 0
    specifies = Specify.where(:task_id => params[:task_id])
    implement_task = ImplementTask.where(:task_id => params[:task_id])
    # Count pdsf nums
    if specifies != nil
      specifies.each do |specify|
        implement_odts = ImplementOdt.where(:odt_id => specify.odt_id)
        if implement_odts != nil
          @pdsf_num += implement_odts.size
        end
      end
    end
    # Count tuple nums
    if implement_task != nil
      @tuple_num = implement_task.size
---
SELECT  "tasks".* FROM "tasks" WHERE "tasks"."task_id" = ? LIMIT 1  [["task_id", 1]]
SELECT  "specifies".* FROM "specifies" WHERE "specifies"."task_id" = ? LIMIT 1  [["task_id", 1]]
SELECT "specifies".* FROM "specifies"
SELECT COUNT(count_column) FROM (SELECT 1 AS count_column FROM "implement_odts" WHERE "implement_odts"."odt_id" = ?) subquery_for_count  [["odt_id", 1]]
SELECT COUNT(*) FROM "implement_tasks" WHERE "implement_tasks"."task_id" = ?  [["task_id", 1]]

  def new
    return if not admin_check
    @original_data_type = OriginalDataType.new
    @task = Task.find_by(task_id: params[:task_id])
---
SELECT  "tasks".* FROM "tasks" WHERE "tasks"."task_id" = ? LIMIT 1  [["task_id", 2]]

  def create
    return if not admin_check
    odt = OriginalDataType.new(original_data_type_params)
    #pdst = ParsingDataSequenceType.new
    if odt.save!# && pdst.save! # TODO : What if only one saved?
      specify = Specify.new(:odt_id => odt.odt_id, :task_id => params[:original_data_type][:task_id])
      #generalize = Generalize.new(:odt_id => odt.odt_id, :pdst_id => pdst.pdst_id)
      if specify.save! # && generalize.save!
---
INSERT INTO "original_data_types" ("schema_info", "mapping_info", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["schema_info", "{\"bar\" : \"string\"}"], ["mapping_info", "{\"foo\" : \"bar\"}"], ["created_at", "2015-11-23 13:31:46.762535"], ["updated_at", "2015-11-23 13:31:46.762535"]]
INSERT INTO "specifies" ("odt_id", "task_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["odt_id", 1], ["task_id", 1], ["created_at", "2015-11-24 14:24:57.881868"], ["updated_at", "2015-11-24 14:24:57.881868"]]