app/controllers/participate_controller.rb

SELECT  "participates".* FROM "participates" WHERE "participates"."submit_user_id" = ? AND "participates"."task_id" = ? LIMIT 1  [["submit_user_id", 2], ["task_id", 1]]
---
  def new
    @duplicate = Participate.find_by(submit_user_id: current_user.user_id, task_id: params[:task_id])

UPDATE "participates" SET "is_pending" = ?, "is_permitted" = ?, "updated_at" = ? WHERE ("participates"."submit_user_id" = 2 AND "participates"."task_id" = 1)  [["is_pending", "f"], ["is_permitted", "t"], ["updated_at", "2015-12-01 03:33:24.210592"]]
---
  def update
    return if not admin_check
    if Participate.update_user_state(params[:task_id], params[:user_id], params[:user_state])