app/controllers/session_controller.rb

  def create
  	user = User.find_by(login_id: params[:session][:login_id])
---
SELECT  "users".* FROM "users" WHERE "users"."login_id" = ? LIMIT 1  [["login_id", "test"]]