app/controllers/task_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."login_id" = ? LIMIT 1  [["login_id", "admin"]]
SELECT  "tasks".* FROM "tasks" WHERE "tasks"."task_id" = ? LIMIT 1  [["task_id", 1]]
---
  def index
  	@user = User.find_by(:login_id => current_user.login_id)
    if @user.is_admin

      @all_tasks = Task.all

INSERT INTO "tasks" ("task_name", "description", "tdt_name", "tdt_schema_info", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["task_name", 0], ["description", "test"], ["tdt_name", "test"], ["tdt_schema_info", ""], ["created_at", "2015-11-20 04:26:13.891643"], ["updated_at", "2015-11-20 04:26:13.891643"]]
---
  def create
	@task = Task.new(task_params)

    if @task.save!

SELECT  "tasks".* FROM "tasks" WHERE "tasks"."task_id" = ? LIMIT 1  [["task_id", 1]]
DELETE FROM "tasks" WHERE "tasks"."task_id" = ?  [["task_id", 1]]
---
  def destroy
    @task = Task.find(params[:id])
    @task.destroy