app/controllers/task_controller.rb

  def show
    return if not admin_check
    # redirect_to :action => 'index'
    @all_tasks = Task.all
---
SELECT "tasks".* FROM "tasks"