app/controllers/user_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."login_id" = ? LIMIT 1  [["login_id", "admin"]]
---
  def show
    @user = User.find(params[:login_id])

INSERT INTO "eval_users" ("user_id", "created_at", "updated_at") VALUES (?, ?, ?)  [["user_id", 6], ["created_at", "2015-12-02 09:38:10.090105"], ["updated_at", "2015-12-02 09:38:10.090105"]]
INSERT INTO "users" ("login_id", "password", "sex", "address", "birthdate", "cellphone", "is_submit", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @user = User.new(user_params)
    if @user.save

SELECT  "users".* FROM "users" WHERE "users"."login_id" = ? LIMIT 1  [["login_id", "admin"]]
---
  def edit
    @edit_user = User.find_by(:login_id => current_user.login_id)

SELECT  "users".* FROM "users" WHERE "users"."login_id" = ? LIMIT 1  [["login_id", "temp1"]]
DELETE FROM "users" WHERE "users"."user_id" = ?  [["user_id", 2]]
---
  def destroy
    @destroy_user = User.find_by(:login_id => current_user.login_id)
    if @destroy_user.destroy

UPDATE "users" SET "name" = ?, "address" = ?, "updated_at" = ? WHERE "users"."user_id" = ?  [["name", ""], ["address", "temp2"], ["updated_at", "2015-11-24 11:42:04.904450"], ["user_id", 2]]
---
  def update
    if User.update_user(user_params)